<template>
  <div class="bg-purple text-black border sm:bg-green md:bg-blue md:text-yellow lg:bg-red xl:bg-orange">
    Test
  </div>
  <h1 class="text-3xl font-bold underline">
    Hello world!
  </h1>
</template>


<!-- От вас требуется собрать интерфейс-форму. В форме должен быть инпут для
задания последовательности нуклеотидов во фрагменте одной из двух цепочек
ДНК.
Форма должна уметь:

1. Реактивно (сразу реагируя на изменения) дорисовывать нуклеотиды из
комплементарного фрагмента цепочки (например, можно под инпутом
дорисовывать оба фрагмента цепочки). Комплементарные пары предлагается
вспомнить самостоятельно или уточнить загуглив.

2. Реактивно отображать температуру плавления заданной последовательности.
“Плавление“ в данном случае означает разрыв всех водородных связей между
комплементарными нуклеотидами. Можно исходить из предположения, что
зависимость температуры плавления от нуклеотидного состава описывается
формулой:
T= 64.9 +41(N(G)+N(C) - 16.4) / (N(A)+N(T)+N(G)+N(C))
для последовательностей длины не меньше 13.
Для последовательностей меньшей длины, используется формула
T= 2 * (N(A) + N(T)) + (N(G) + N(C)) * 4
где N(letter) - количество нуклеотида letter во введенной
последовательности (только в одном из двух фрагментов).
3. Предположим, что данная формула работает хорошо для последовательностей
не длиннее 100 нуклеотидов, поэтому можно ограничить длину вводимой
последовательности сотней символов.
Кроме того, будет разумно сделать так, чтобы форма не пускала любые
символы, кроме “A”, “T”, “G”, “C” или ругалась на их присутствие.

Желательно реализовать на Vue, заодно разобравшись с основами написания
шаблонов и компонентов. Так же, рекомендуется организовать работу компонента с формой так,
чтобы в нем использовались стандартные инструменты для динамической генерации контента (встроенная директива v-for, например, чтобы комплементарные пары нуклеотидов отображались с помощью этой директивы)
В ответ можете прислать ссылку на репозиторий с проектом,
чтобы его можно было склонировать и запустить локально.
 -->
